Benchmark_tests/ycsb/workloadA/thread_32.txt
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
[...]
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
[...]
[OVERALL], RunTime(ms), 134105
[OVERALL], Throughput(ops/sec), 7.456843518138772
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 28
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.02087916185078856
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.02087916185078856
[READ], Operations, 517
[READ], AverageLatency(us), 534223.2263056093
[READ], MinLatency(us), 308224
[READ], MaxLatency(us), 1417215
[READ], 95thPercentileLatency(us), 819199
[READ], 99thPercentileLatency(us), 838143
[READ], Return=OK, 517
[UPDATE-FAILED], Operations, 41
[UPDATE-FAILED], AverageLatency(us), 2.9818374243902437E7
[UPDATE-FAILED], MinLatency(us), 322816
[UPDATE-FAILED], MaxLatency(us), 52002815
[UPDATE-FAILED], 95thPercentileLatency(us), 51838975
[UPDATE-FAILED], 99thPercentileLatency(us), 52002815
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 1025736.0
[CLEANUP], MinLatency(us), 743936
[CLEANUP], MaxLatency(us), 1461247
[CLEANUP], 95thPercentileLatency(us), 1434623
[CLEANUP], 99thPercentileLatency(us), 1461247
[UPDATE], Operations, 442
[UPDATE], AverageLatency(us), 3805927.3846153845
[UPDATE], MinLatency(us), 312832
[UPDATE], MaxLatency(us), 50626559
[UPDATE], 95thPercentileLatency(us), 33161215
[UPDATE], 99thPercentileLatency(us), 46563327
[UPDATE], Return=OK, 442
[UPDATE], Return=ERROR, 41